capture/tr069(2)

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body>
    <cwmp:SetParameterAttributes>
      <ParameterList SOAP-ENC:arrayType="cwmp:SetParameterAttributesStruct[2]">
        <SetParameterAttributesStruct>
          <Name>Device.ManagementServer.NATDetected</Name>
          <NotificationChange>1</NotificationChange>
          <Notification>2</Notification>
          <AccessListChange>0</AccessListChange>
          <AccessList SOAP-ENC:arrayType="xsd:string[0]"/>
        </SetParameterAttributesStruct>
        <SetParameterAttributesStruct>
          <Name>Device.ManagementServer.UDPConnectionRequestAddress</Name>
          <NotificationChange>1</NotificationChange>
          <Notification>2</Notification>
          <AccessListChange>0</AccessListChange>
          <AccessList SOAP-ENC:arrayType="xsd:string[0]"/>
        </SetParameterAttributesStruct>
      </ParameterList>
    </cwmp:SetParameterAttributes>
  </SOAP-ENV:Body></SOAP-ENV:Envelope>